РП/src/Catalogs/ЭтапыПроизводства/ЭтапыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроизводства</name>
  <owners>Catalog.РесурсныеСпецификации</owners>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующегоЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуВидовРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДлительностиЭтапа</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительныйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершающийБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПредварительногоБуфера</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗавершающегоБуфера</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоНаСтороне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыПартнера</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЕдиницПартийИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемаяМощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДоОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УслугаПереработчика</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаУслугиПереработчика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРабочихЦентров</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>CatalogRef.ВариантыНаладки</types>
      </type>
    </attributes>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Занятость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АльтернативныеВидыРабочихЦентров</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>CatalogRef.ВариантыНаладки</types>
      </type>
    </attributes>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиВидыРабочихЦентров</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Enums/ЕдиницыИзмеренияВремени/ЕдиницыИзмеренияВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕдиницыИзмеренияВремени</name>
  <enumValues>
    <name>Секунда</name>
  </enumValues>
  <enumValues>
    <name>Минута</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Сутки</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ТочностьГрафикаПроизводства/ТочностьГрафикаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТочностьГрафикаПроизводства</name>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ВидыРабочихЦентров/ВидыРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРабочихЦентров</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйЗначимыйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьДоступностьПоГрафикуРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДоступностьРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДоступностиРЦ</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяВариантыНаладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениПереналадки</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараллельнаяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЦентров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьДоступностьДляВидаРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Catalogs/ТехнологическиеОперации/ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеОперации</name>
  <owners>Catalog.МаршрутныеКарты</owners>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитВложенныйМаршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйМаршрут</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучноеЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВспомогательныеРабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/ЭтапыПроизводства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Возращает новый номер этапа.
//
// Параметры:
//   Спецификация - СправочникСсылка.РесурсныеСпецификации - спецификация
//
// Возвращаемое значение:
//   Число        - Новый номер этапа
//
Функция НовыйНомерЭтапа(Спецификация) Экспорт

	Если Спецификация.Пустая() Тогда
		
		Возврат 1;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыПроизводства.НомерЭтапа КАК НомерЭтапа
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	|ГДЕ
	|	ЭтапыПроизводства.Владелец = &Спецификация
	|	И НЕ ЭтапыПроизводства.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЭтапа УБЫВ");
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат 1;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.НомерЭтапа + 1;

КонецФункции

// Возращает основную единицу измерения времени этапа.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ЕдиницыИзмеренияВремени - основная единица измерения времени этапа
//
Функция ОсновнаяЕдиницаВремени() Экспорт

	Возврат Перечисления.ЕдиницыИзмеренияВремени.Минута;

КонецФункции

// Возращает основную единицу измерения времени буфера.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ЕдиницыИзмеренияВремени - основная единица измерения времени буфера
//
Функция ОсновнаяЕдиницаВремениБуфера() Экспорт

	Возврат Перечисления.ЕдиницыИзмеренияВремени.День;

КонецФункции

// Возращает основную единицу измерения времени длительности этапа УББВ.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ЕдиницыИзмеренияВремени - основная единица измерения времени этапа УББВ
//
Функция ОсновнаяЕдиницаВремениДлительностиЭтапаУББВ() Экспорт
	
	Возврат Перечисления.ЕдиницыИзмеренияВремени.День;
	
КонецФункции

// Возвращает имена блокруемых реквизитов
//
// Возвращаемое значание:
//	Массив - имена блокируемых реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("НомерЭтапа");
	МассивЭлементов.Добавить("НомерСледующегоЭтапа");
	МассивЭлементов.Добавить("Подразделение");
	МассивЭлементов.Добавить("Подразделение1");
	МассивЭлементов.Добавить("СпособПроизводства");
	МассивЭлементов.Добавить("МаршрутнаяКарта");
	МассивЭлементов.Добавить("ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий");
	МассивЭлементов.Добавить("ПланироватьРаботуВидовРабочихЦентров");
	МассивЭлементов.Добавить("ВидыРабочихЦентров");
	МассивЭлементов.Добавить("Партнер");
	МассивЭлементов.Добавить("ГрафикРаботыПартнера");
	МассивЭлементов.Добавить("ЗаполнитьВидыРабочихЦентровПоМаршрутнойКарте");
	МассивЭлементов.Добавить("ДобавитьАльтернативный");
	
	Возврат МассивЭлементов;
	
КонецФункции

// Запускает фоновое задание которое обновляет реквизит ДнейДоОкончания для всех этапов спецификации
//
// Параметры:
//  Спецификация - СправочникСсылка.РесурсныеСпецификации - спецификация, по которой необходимо рассчитать
//
Процедура РассчитатьДнейДоОкончанияПроизводстваВФоне(Спецификация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ключ = Спецификация.УникальныйИдентификатор();
	
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", Ключ);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если АктивныеЗадания.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеЗадания = НСтр("ru='Обновление Этапов ресурсной спецификации: %Ссылка%';uk='Оновлення Етапів ресурсної специфікації: %Ссылка%'");
	НаименованиеЗадания = СтрЗаменить(НаименованиеЗадания, "%Ссылка%", Спецификация);
	
	ИмяЭкспортнойПроцедуры = "Справочники.ЭтапыПроизводства.РассчитатьДнейДоОкончанияПроизводстваВТранзакции";
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив();
	ПараметрыЭкспортнойПроцедуры.Добавить(Спецификация);
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ИмяЭкспортнойПроцедуры);
	ПараметрыЗадания.Добавить(ПараметрыЭкспортнойПроцедуры);
	
	ФоновыеЗадания.Выполнить("РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации", ПараметрыЗадания, Ключ, НаименованиеЗадания);
	
КонецПроцедуры

//++ НЕ УТКА

// Проверяет соответствуют ли значения реквизитов выбранному подразделению
// Если не соответствуют то значения очищаются
//
// Параметры:
//  Объект	- ДанныеФормы - объект содержащий данные этапа
//
Процедура ПроверитьСоответствиеРеквизитовПодразделению(Объект) Экспорт

	Если Объект.Подразделение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыРабочихЦентров.Ссылка
	|ИЗ
	|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|ГДЕ
	|	(ВидыРабочихЦентров.Ссылка В (&ВидРабочегоЦентра)
	|		ИЛИ ВидыРабочихЦентров.Ссылка В (&АльтернативныеВидыРабочихЦентров))
	|	И ВидыРабочихЦентров.Подразделение <> &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение",     Объект.Подразделение);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра", Объект.ВидыРабочихЦентров.Выгрузить().ВыгрузитьКолонку("ВидРабочегоЦентра"));
	Запрос.УстановитьПараметр("АльтернативныеВидыРабочихЦентров", Объект.АльтернативныеВидыРабочихЦентров.Выгрузить().ВыгрузитьКолонку("ВидРабочегоЦентра"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ВидРабочегоЦентра", Выборка.Ссылка);
  		СписокСтрок = Объект.ВидыРабочихЦентров.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаВидРЦ Из СписокСтрок Цикл
			СтрокаВидРЦ.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
			СтрокаВидРЦ.Использовать = Истина;
		КонецЦикла;
		
		СтруктураПоиска = Новый Структура("ВидРабочегоЦентра", Выборка.Ссылка);
  		СписокСтрок = Объект.АльтернативныеВидыРабочихЦентров.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаВидРЦ Из СписокСтрок Цикл
			Объект.АльтернативныеВидыРабочихЦентров.Удалить(СтрокаВидРЦ);
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ Объект.МаршрутнаяКарта.Пустая() Тогда
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МаршрутнаяКарта, "Подразделение");
		Если Объект.Подразделение <> Подразделение Тогда
			Объект.МаршрутнаяКарта = Справочники.МаршрутныеКарты.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список видов рабочих центров на основании выбранной маршрутной карте
//
// Параметры:
//  ДанныеЭтапа	- ДанныеФормы - объект содержащий данные этапа
//
Процедура ЗаполнитьВидыРабочихЦентровПоМаршрутнойКарте(ДанныеЭтапа) Экспорт

	ДанныеЭтапа.ВидыРабочихЦентров.Очистить();
	ДанныеЭтапа.АльтернативныеВидыРабочихЦентров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; //временные таблицы используются повторно
	
	ТекстЗапросаСписокЭтапов = "ВЫБРАТЬ
	               |	&МаршрутнаяКарта КАК МаршрутнаяКарта
	               |ПОМЕСТИТЬ СписокЭтапов";
					   
	Запрос.УстановитьПараметр("МаршрутнаяКарта", ДанныеЭтапа.МаршрутнаяКарта);
	Запрос.УстановитьПараметр("Подразделение",   ДанныеЭтапа.Подразделение);
	
	ВидыРабочихЦентровПоКоторымНужноПланироватьРаботу(
				Запрос, 
				ТекстЗапросаСписокЭтапов, 
				ДанныеЭтапа.ВидыРабочихЦентров);
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	// Заполним значения буферов
	БуферыМаршрутнойКарты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДанныеЭтапа.МаршрутнаяКарта, 
		"ПредварительныйБуфер,ЗавершающийБуфер,ЕдиницаИзмеренияПредварительногоБуфера,ЕдиницаИзмеренияЗавершающегоБуфера");
	ЗаполнитьЗначенияСвойств(ДанныеЭтапа, БуферыМаршрутнойКарты);		
	
	Если ДанныеЭтапа.ЕдиницаИзмеренияПредварительногоБуфера.Пустая() Тогда
		ДанныеЭтапа.ЕдиницаИзмеренияПредварительногоБуфера = ОсновнаяЕдиницаВремениБуфера();
	КонецЕсли; 
	Если ДанныеЭтапа.ЕдиницаИзмеренияЗавершающегоБуфера.Пустая() Тогда
		ДанныеЭтапа.ЕдиницаИзмеренияЗавершающегоБуфера = ОсновнаяЕдиницаВремениБуфера();
	КонецЕсли; 
	
КонецПроцедуры

//-- НЕ УТКА

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция НедоступныеЭлементыЗакрытойСпецификации() Экспорт

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ПредварительныйБуфер");
	МассивЭлементов.Добавить("ЕдиницаИзмеренияПредварительногоБуфера");
	МассивЭлементов.Добавить("ЗавершающийБуфер");
	МассивЭлементов.Добавить("ЕдиницаИзмеренияЗавершающегоБуфера");
	МассивЭлементов.Добавить("ДлительностьЭтапа");
	МассивЭлементов.Добавить("ДлительностьЭтапа1");
	МассивЭлементов.Добавить("ЕдиницаИзмеренияДлительностиЭтапа");
	МассивЭлементов.Добавить("ОптимальноеКоличествоПередачиМеждуЭтапами");
	МассивЭлементов.Добавить("Непрерывный");
	МассивЭлементов.Добавить("РазбиватьМаршрутныеЛисты");
	МассивЭлементов.Добавить("МаксимальноеКоличествоЕдиницПартийИзделия");

	Возврат МассивЭлементов;
	
КонецФункции

Процедура ЗаполнитьВыборЕдиницыИзмеренияБуфера(ИнтервалПланирования, СписокВыбора) Экспорт

	СписокВыбора.Очистить();
	//++ НЕ УТКА
	Если ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Час Тогда
		СписокВыбора.Добавить(Перечисления.ЕдиницыИзмеренияВремени.Час);
	КонецЕсли;
	//-- НЕ УТКА
	СписокВыбора.Добавить(Перечисления.ЕдиницыИзмеренияВремени.День);
	
КонецПроцедуры

Процедура РассчитатьДнейДоОкончанияПроизводстваВТранзакции(Спецификация) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		РассчитатьДнейДоОкончанияПроизводства(Спецификация);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru='Обновление Этапов ресурсной спецификации';uk='Оновлення Етапів ресурсної специфікації'"), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.РесурсныеСпецификации,
			Спецификация,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура РассчитатьДнейДоОкончанияПроизводства(Спецификация) Экспорт
	
	Если ТранзакцияАктивна() Тогда
	
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ЭтапыПроизводства");
		ЭлементБлокировки.УстановитьЗначение("Владелец", Спецификация);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводства.Ссылка,
	|	ЭтапыПроизводства.НомерЭтапа КАК НомерЭтапа,
	|	ЭтапыПроизводства.НомерСледующегоЭтапа,
	|	ЭтапыПроизводства.ДлительностьЭтапа,
	|	ЭтапыПроизводства.ДнейДоОкончания,
	|	0 КАК ДнейДоОкончанияРасчетная
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	|ГДЕ
	|	ЭтапыПроизводства.Владелец = &Ссылка
	|	И НЕ ЭтапыПроизводства.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЭтапа";
	
	Запрос.УстановитьПараметр("Ссылка", Спецификация);
	
	ТаблицаЭтапов = Запрос.Выполнить().Выгрузить();
	ТаблицаЭтапов.Индексы.Добавить("НомерСледующегоЭтапа");
	
	Отбор = Новый Структура("НомерСледующегоЭтапа", 0); // Выбираем последний этап
	
	ЭтапыРасчета = ТаблицаЭтапов.НайтиСтроки(Отбор);
	
	Пока ЭтапыРасчета.Количество() > 0 Цикл
		
		Этап = ЭтапыРасчета[0];
		
		Если Этап.НомерСледующегоЭтапа = 0 Тогда
			
			Этап.ДнейДоОкончанияРасчетная = Этап.ДлительностьЭтапа;
			
		КонецЕсли; 
		
		Отбор = Новый Структура("НомерСледующегоЭтапа", Этап.НомерЭтапа); 
		НайденныеЭтапы = ТаблицаЭтапов.НайтиСтроки(Отбор);
		Для каждого НайденныйЭтап Из НайденныеЭтапы Цикл
			
			НайденныйЭтап.ДнейДоОкончанияРасчетная = Макс(НайденныйЭтап.ДнейДоОкончанияРасчетная, НайденныйЭтап.ДлительностьЭтапа + Этап.ДнейДоОкончанияРасчетная);
			ЭтапыРасчета.Добавить(НайденныйЭтап);
			
		КонецЦикла;
		
		ЭтапыРасчета.Удалить(0);
		
	КонецЦикла;
	
	Для каждого Этап Из ТаблицаЭтапов Цикл
	
		Если Этап.ДнейДоОкончания = Этап.ДнейДоОкончанияРасчетная Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = Этап.Ссылка.ПолучитьОбъект();
		Объект.ДнейДоОкончания = Этап.ДнейДоОкончанияРасчетная;
		Объект.ДополнительныеСвойства.Вставить("ЗапретитьРасчетДнейДоОкончания", Истина);
		
		Попытка
			Объект.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось записать: %Ссылка% по причине: %Причина%';uk='Не вдалося записати: %Ссылка% по причині: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Этап.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(НСтр("ru='Обновление дней до окончания этапов';uk='Оновлення днів до закінчення етапів'"), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ЭтапыПроизводства, Этап.Ссылка, ТекстСообщения);
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

//++ НЕ УТКА

Процедура ВидыРабочихЦентровПоКоторымНужноПланироватьРаботу(Запрос, ТекстЗапросаСписокЭтапов, СписокВидовРабочихЦентров)

	ИндексРезультатаЗапроса = 0;
	ТекстЗапроса = "";
	
	Если ТекстЗапросаСписокЭтапов <> Неопределено Тогда
		ИндексРезультатаЗапроса = 1;
		
		ТекстЗапроса = ТекстЗапросаСписокЭтапов 
				+ "
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|"
	КонецЕсли; 
	ТекстЗапроса = ТекстЗапроса
			+ "ВЫБРАТЬ
			  |	СписокЭтапов.МаршрутнаяКарта КАК МаршрутнаяКарта
			  |ПОМЕСТИТЬ СписокМаршрутныхКарт
			  |ИЗ
			  |	СписокЭтапов КАК СписокЭтапов
			  |
			  |ИНДЕКСИРОВАТЬ ПО
			  |	МаршрутнаяКарта
			  |;
			  |
			  |////////////////////////////////////////////////////////////////////////////////
			  // 1. Виды рабочих центров по которым нужно планировать работу
			  |ВЫБРАТЬ РАЗЛИЧНЫЕ
			  |	ВЫБОР	
			  |		КОГДА спрОперации.РабочийЦентр ССЫЛКА Справочник.ВидыРабочихЦентров
			  |			ТОГДА спрОперации.РабочийЦентр
			  |		ИНАЧЕ ВЫРАЗИТЬ(спрОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра
			  |	КОНЕЦ КАК ВидРабочегоЦентра
			  |ИЗ
			  |	СписокМаршрутныхКарт КАК СписокМаршрутныхКарт
			  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК спрОперации
			  |		ПО (спрОперации.Владелец = СписокМаршрутныхКарт.МаршрутнаяКарта)
			  |			И (НЕ спрОперации.СодержитВложенныйМаршрут)
			  |			И (ВЫБОР 
			  |					КОГДА спрОперации.РабочийЦентр ССЫЛКА Справочник.ВидыРабочихЦентров
			  |						ТОГДА ВЫРАЗИТЬ(спрОперации.РабочийЦентр КАК Справочник.ВидыРабочихЦентров).ПланироватьРаботу
			  |					КОГДА спрОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
			  |						ТОГДА ВЫРАЗИТЬ(спрОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра.ПланироватьРаботу
			  |					ИНАЧЕ ЛОЖЬ
			  |				КОНЕЦ)
			  | ГДЕ Не спрОперации.Ссылка.ПометкаУдаления
			  |		И ВЫБОР	
			  |			КОГДА спрОперации.РабочийЦентр ССЫЛКА Справочник.ВидыРабочихЦентров
			  |				ТОГДА ВЫРАЗИТЬ(спрОперации.РабочийЦентр КАК Справочник.ВидыРабочихЦентров).Подразделение
			  |			ИНАЧЕ ВЫРАЗИТЬ(спрОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра.Подразделение
			  |		КОНЕЦ = &Подразделение
			  |;
			  |
			  |////////////////////////////////////////////////////////////////////////////////
			  |УНИЧТОЖИТЬ СписокЭтапов
			  |;
			  |
			  |////////////////////////////////////////////////////////////////////////////////
			  |ВЫБРАТЬ
			  |	спрОперации.ВложенныйМаршрут КАК МаршрутнаяКарта
			  |ПОМЕСТИТЬ СписокЭтапов
			  |ИЗ
			  |	СписокМаршрутныхКарт КАК СписокМаршрутныхКарт
			  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК спрОперации
			  |		ПО (спрОперации.Владелец = СписокМаршрутныхКарт.МаршрутнаяКарта)
			  |			И спрОперации.СодержитВложенныйМаршрут
			  | ГДЕ Не спрОперации.Ссылка.ПометкаУдаления
			  |;
			  |
			  |////////////////////////////////////////////////////////////////////////////////
			  |УНИЧТОЖИТЬ СписокМаршрутныхКарт";
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	// Результат[1] - Виды рабочих центров по которым нужно планировать работ
	
	Если Результат[1 + ИндексРезультатаЗапроса].Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполним выходные изделия
	Выборка = Результат[1 + ИндексРезультатаЗапроса].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ВидРабочегоЦентра", Выборка.ВидРабочегоЦентра);
  		СписокСтрок = СписокВидовРабочихЦентров.НайтиСтроки(СтруктураПоиска);
		Если СписокСтрок.Количество() = 0 Тогда
			НоваяСтрока = СписокВидовРабочихЦентров.Добавить();
			НоваяСтрока.ВидРабочегоЦентра = Выборка.ВидРабочегоЦентра;
			НоваяСтрока.КлючСвязи = Новый УникальныйИдентификатор;
			
			УправлениеДаннымиОбИзделияхКлиентСервер.ПриВводеНовойСтрокиВидовРабочихЦентров(НоваяСтрока, Ложь);
		КонецЕсли; 
	КонецЦикла;
	
	ВидыРабочихЦентровПоКоторымНужноПланироватьРаботу(Запрос, Неопределено, СписокВидовРабочихЦентров);

КонецПроцедуры

//-- НЕ УТКА

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#Область Обработчики_2_0_11

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
